//Написать программу, вычисляющую среднее арифметическое чисел в последовательности.
//ДОМАШНЯЯ РАБОТА 22.10.2017
#include <iostream>

using namespace std;

int main()
{
	int k, cnt, sum;
	cin >> k;
	cnt = 0;
	sum = 0;
  cnt = cnt + 1;
  sum = sum + k;
	}
	while (k != 0) {
		cin >> k;
		cnt = cnt + 1;
		sum = sum + k;
	}
	double l;
	l = sum / cnt;
	cout << l;
	

}
